Repository: Moosphan/Numi
Catalog: App/NumiApp/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, zh_hant

# tab.plans
source: 计划
en: Plans
ja: プラン
zh_hant: 計劃

# common.save
source: 保存
en: Save
zh_hant: 儲存

# common.cancel
source: 取消
en: Cancel
ja: キャンセル

# common.delete
source: 删除
en: Delete
ja: 削除
zh_hant: 刪除

# common.edit
source: 编辑
en: Edit
ja: 編集
zh_hant: 編集

# common.close
source: 关闭
en: Close
ja: 閉じる
zh_hant: 關閉

# common.add
source: 添加
en: Add
ja: 追加
zh_hant: 新增

# common.done
source: 完成
en: Done
ja: 完了
zh_hant: 完了

# common.back
source: 返回
en: Back
ja: 戻る

# common.share
source: 分享
en: Share
ja: 共有

# common.refresh
source: 刷新
en: Refresh
ja: 更新
zh_hant: 重新整理

# common.collapse
source: 收起
en: Collapse
ja: 折りたたむ
zh_hant: 收合

# common.default
source: 默认
en: Default
ja: デフォルト
zh_hant: 預設

# common.search
source: 搜索
en: Search
ja: 検索
zh_hant: 搜尋

# common.select
source: 选择
en: Select
ja: 選択
zh_hant: 選擇

# common.confirm
source: 确认
en: Confirm
ja: 確認
zh_hant: 確認

# record.expense
source: 支出
en: Expense

# record.income
source: 收入
en: Income
ja: 収入

# record.transfer
source: 转账
en: Transfer
ja: 振替
zh_hant: 轉帳

# record.amount
source: 金额
en: Amount
ja: 金額
zh_hant: 金額

# record.note
source: 备注
en: Note
ja: メモ
zh_hant: 備註

# record.type
source: 类型
en: Type
ja: タイプ
zh_hant: 類型

# record.category
source: 分类
en: Category
ja: カテゴリ
zh_hant: 分類

# record.date
source: 日期
en: Date
ja: 日付

# record.account
source: 账户
en: Account
ja: アカウント
zh_hant: 帳戶

# record.new
source: 记一笔
en: New Record
ja: 記録する
zh_hant: 記一筆

# record.new.expense
source: 新建支出
en: New Expense
ja: 新しい支出
zh_hant: 新增支出

# record.new.income
source: 新建收入
en: New Income
ja: 新しい収入
zh_hant: 新增收入

# record.new.transfer
source: 新建转账
en: New Transfer
ja: 新しい振替
zh_hant: 新增轉帳

# record.edit
source: 编辑账单
en: Edit Record
ja: 記録を編集
zh_hant: 編輯帳單

# record.detail
source: 账单详情
en: Record Details
ja: 記録詳細
zh_hant: 帳單詳情

# record.again
source: 再记一笔
en: Record Again
ja: もう一度記録
zh_hant: 再記一筆

# record.transfer.title
source: 账户转账
en: Account Transfer
ja: アカウント振替
zh_hant: 帳戶轉帳

# record.transfer.desc
source: 转账只调整账户余额，不计入支出或收入。
en: Transfers only adjust account balances and are not counted as expenses or income.
ja: 振替はアカウント残高を調整するだけで、支出や収入には計上されません。
zh_hant: 轉帳只調整帳戶餘額，不計入支出或收入。

# record.transfer.from
source: 转出
en: From
ja: 振替元
zh_hant: 轉出

# record.transfer.to
source: 转入
en: To
ja: 振替先
zh_hant: 轉入

# record.select.category
source: 选择分类
en: Select Category
ja: カテゴリを選択
zh_hant: 選擇分類

# record.deleted
source: 已删除记录
en: Record deleted
ja: 記録を削除しました
zh_hant: 已刪除記錄

# record.undo
source: 撤销
en: Undo
ja: 元に戻す
zh_hant: 撤銷

# record.deleted.msg
source: 删除后可立即撤销。
en: You can undo immediately after deletion.
ja: 削除後すぐに元に戻せます。
zh_hant: 刪除後可立即撤銷。

# record.delete.confirm
source: 删除这笔记录？
en: Delete this record?
ja: この記録を削除しますか？
zh_hant: 刪除這筆記錄？

# ledger.title
source: 账本管理
en: Ledger Management
ja: 台帳管理
zh_hant: 帳本管理

# ledger.section
source: 账本
en: Ledger
ja: 台帳
zh_hant: 帳本

# ledger.current
source: 当前
en: Current
ja: 現在
zh_hant: 目前

# ledger.switch
source: 切换到账本
en: Switch to Ledger
ja: 台帳を切り替え
zh_hant: 切換到帳本

# ledger.new
source: 新建账本
en: New Ledger
ja: 新しい台帳
zh_hant: 新增帳本

# ledger.edit
source: 编辑账本
en: Edit Ledger
ja: 台帳を編集
zh_hant: 編輯帳本

# ledger.name.placeholder
source: 例如：个人账本、家庭账本
en: e.g. Personal, Family
ja: 例：個人台帳、家族台帳
zh_hant: 例如：個人帳本、家庭帳本

# ledger.currency
source: 货币
en: Currency
ja: 通貨
zh_hant: 貨幣

# ledger.select.currency
source: 选择货币
en: Select Currency
ja: 通貨を選択
zh_hant: 選擇貨幣

# ledger.name.exists
source: 账本名称已存在
en: Ledger name already exists
ja: 台帳名は既に存在します
zh_hant: 帳本名稱已存在

# ledger.delete.confirm
source: 确认删除
en: Confirm Delete
ja: 削除の確認
zh_hant: 確認刪除

# ledger.delete.msg
source: 删除「%@」将同时删除其关联的 %lld 条交易记录和预算设置，此操作不可撤销。
en: Deleting '%@' will also delete %lld transaction records and budget settings. This cannot be undone.
ja: 「%@」を削除すると、関連する %lld 件の取引記録と予算設定も削除されます。この操作は元に戻せません。
zh_hant: 刪除「%@」將同時刪除其關聯的 %lld 筆交易記錄和預算設定，此操作無法復原。

# ledger.info
source: 账本用于隔离不同场景的账单数据。切换账本后，交易列表、统计和预算都会随之变化。分类和账户在所有账本间共享。
en: Ledgers help separate billing data for different scenarios. Switching ledgers changes the transaction list, statistics, and budgets. Categories and accounts are shared across all ledgers.
ja: 台帳は、シーンごとに記録データを分けるために使います。台帳を切り替えると、取引一覧、統計、予算も切り替わります。カテゴリと口座はすべての台帳で共有されます。
zh_hant: 帳本用於隔離不同情境的帳單資料。切換帳本後，交易列表、統計和預算都會隨之變化。分類和帳戶在所有帳本間共享。

# ledger.switch.title
source: 切换账本
en: Switch Ledger
ja: 台帳を切り替え
zh_hant: 切換帳本

# category.title
source: 分类管理
en: Category Management
ja: カテゴリ管理
zh_hant: 分類管理

# category.type
source: 分类类型
en: Category Type
ja: カテゴリタイプ
zh_hant: 分類類型

# category.expense
source: 支出分类
en: Expense Categories
ja: 支出カテゴリ
zh_hant: 支出分類

# category.income
source: 收入分类
en: Income Categories
ja: 収入カテゴリ
zh_hant: 收入分類

# category.hidden
source: 已隐藏
en: Hidden
ja: 非表示
zh_hant: 已隱藏

# category.show.in.record
source: 记账页显示
en: Show in Record
ja: 記録ページに表示
zh_hant: 記帳頁顯示

# category.show
source: 显示
en: Show
ja: 表示
zh_hant: 顯示

# category.hide
source: 隐藏
en: Hide
ja: 非表示
zh_hant: 隱藏

# category.name
source: 分类名称
en: Category Name
ja: カテゴリ名
zh_hant: 分類名稱

# category.name.label
source: 名称
en: Name
ja: 名前
zh_hant: 名稱

# category.name.placeholder
source: 例如：餐饮、交通
en: e.g. Dining, Transport
ja: 例：食費、交通費
zh_hant: 例如：餐飲、交通

# category.select.icon
source: 选择图标
en: Select Icon
ja: アイコンを選択
zh_hant: 選擇圖示

# category.add
source: 添加分类
en: Add Category
ja: カテゴリを追加
zh_hant: 新增分類

# category.hide.desc
source: 关闭后，该分类不会出现在新增和编辑账单的分类网格中，历史账单仍会保留原分类。
en: After hiding, this category won't appear in the category grid when adding or editing records. Historical records will keep their original category.
ja: 非表示にすると、記録の追加や編集時のカテゴリ一覧には表示されません。過去の記録には元のカテゴリが保持されます。
zh_hant: 關閉後，該分類不會出現在新增和編輯帳單的分類網格中，歷史帳單仍會保留原分類。

# account.title
source: 账户管理
en: Account Management
ja: アカウント管理
zh_hant: 帳戶管理

# account.total.asset
source: 总资产
en: Total Assets
ja: 総資産
zh_hant: 總資產

# account.section
source: 账户
en: Account
ja: アカウント
zh_hant: 帳戶

# account.hidden
source: 已隐藏
en: Hidden
ja: 非表示
zh_hant: 已隱藏

# account.count.asset
source: 计入资产
en: Included in Assets
ja: 資産に含める
zh_hant: 計入資產

# account.not.count.asset
source: 不计入资产
en: Not Included in Assets
ja: 資産に含めない
zh_hant: 不計入資產

# account.balance
source: 余额
en: Balance
ja: 残高
zh_hant: 餘額

# account.add
source: 新增账户
en: Add Account
ja: アカウントを追加
zh_hant: 新增帳戶

# account.edit
source: 编辑账户
en: Edit Account
ja: アカウントを編集
zh_hant: 編輯帳戶

# account.info
source: 账户信息
en: Account Info
ja: アカウント情報
zh_hant: 帳戶資訊

# account.name
source: 账户名称
en: Account Name
ja: アカウント名
zh_hant: 帳戶名稱

# account.type
source: 账户类型
en: Account Type
ja: アカウントタイプ
zh_hant: 帳戶類型

# account.current.balance
source: 当前余额
en: Current Balance
ja: 現在残高
zh_hant: 當前餘額

# account.count.total
source: 计入总资产
en: Included in Total Assets
ja: 総資産に含める
zh_hant: 計入總資產

# account.hide
source: 隐藏账户
en: Hide Account
ja: アカウントを非表示
zh_hant: 隱藏帳戶

# account.initial.amount
source: 初始金额
en: Initial Amount
ja: 初期金額
zh_hant: 初始金額

# account.total.expense
source: 累计支出
en: Total Expenses
ja: 累計支出
zh_hant: 累計支出

# account.total.income
source: 累计收入
en: Total Income
ja: 累計収入
zh_hant: 累計收入

# account.transaction.count
source: 交易笔数
en: Transaction Count
ja: 取引件数
zh_hant: 交易筆數

# account.recent.transactions
source: 最近交易
en: Recent Transactions
ja: 最近の取引

# account.detail
source: 账户详情
en: Account Details
ja: アカウント詳細
zh_hant: 帳戶詳情

# account.balance.adjust.desc
source: 调整余额会直接更新账户当前余额；已有账单仍保留在明细中。
en: Adjusting the balance directly updates the current account balance. Existing records remain in the transactions list.
ja: 残高を調整すると、現在の口座残高が直接更新されます。既存の記録は明細に残ります。
zh_hant: 調整餘額會直接更新帳戶目前餘額；既有帳單仍保留在明細中。

# account.info.desc
source: 仅统计已开启"计入资产"的账户；隐藏账户不会出现在记账页账户选择器中，历史记录仍保留原账户。
en: Only accounts with 'Include in Assets' enabled are counted. Hidden accounts won't appear in the account selector when recording, but historical records keep their original account.
ja: 「資産に含める」が有効な口座のみ集計します。非表示の口座は記録時の口座選択には表示されませんが、過去の記録には元の口座が保持されます。
zh_hant: 僅統計已開啟「計入資產」的帳戶；隱藏帳戶不會出現在記帳頁帳戶選擇器中，歷史記錄仍保留原帳戶。

# account.type.cash
source: 现金
en: Cash
ja: 現金
zh_hant: 現金

# account.type.debitCard
source: 储蓄卡
en: Debit Card
ja: デビットカード

# account.type.creditCard
source: 信用卡
en: Credit Card
ja: クレジットカード

# account.type.wechat
source: 微信
en: WeChat
ja: WeChat

# account.type.alipay
source: 支付宝
en: Alipay
ja: Alipay
zh_hant: 支付寶

# account.type.virtual
source: 虚拟账户
en: Virtual Account
ja: バーチャルアカウント
zh_hant: 虛擬帳戶

# account.type.liability
source: 负债
en: Liability
ja: 負債
zh_hant: 負債

# account.type.other
source: 其他
en: Other
ja: その他

# insight.title
source: 洞悉
en: Insights
ja: インサイト
zh_hant: 洞察

# insight.expense
source: 支出
en: Expense

# insight.income
source: 收入
en: Income
ja: 収入

# insight.balance
source: 结余
en: Balance
ja: 収支
zh_hant: 結餘

# insight.record.count
source: 记账次数
en: Record Count
ja: 記録回数
zh_hant: 記帳次數

# insight.expense.distribution
source: 支出分布
en: Expense Distribution

# insight.income.distribution
source: 收入分布
en: Income Distribution
ja: 収入分布

# insight.total.amount
source: 总金额
en: Total Amount
ja: 合計金額
zh_hant: 總金額

# insight.transaction.count
source: %lld 笔交易
en: %lld transactions
ja: %lld件の取引
zh_hant: %lld 筆交易

# insight.no.transactions
source: 暂无交易记录
en: No transactions yet
ja: 取引記録がありません
zh_hant: 暫無交易記錄

# insight.dim.day
source: 日
en: Day

# insight.dim.week
source: 周
en: Week
ja: 週
zh_hant: 週

# insight.dim.month
source: 月
en: Month

# insight.dim.quarter
source: 季
en: Quarter
ja: 四半期

# insight.dim.year
source: 年
en: Year

# budget.title
source: 预算总览
en: Budget Overview
ja: 予算概要
zh_hant: 預算總覽

# budget.weekly
source: 周预算
en: Weekly Budget
ja: 週間予算
zh_hant: 週預算

# budget.monthly
source: 月预算
en: Monthly Budget
ja: 月間予算
zh_hant: 月預算

# budget.this.week.expense
source: 本周支出
en: This Week's Expenses
ja: 今週の支出
zh_hant: 本週支出

# budget.this.month.expense
source: 本月支出
en: This Month's Expenses
ja: 今月の支出

# budget.used.budget
source: 已用 / 预算
en: Used / Budget
ja: 使用済み / 予算
zh_hant: 已用 / 預算

# budget.remaining
source: 剩余
en: Remaining
ja: 残り
zh_hant: 剩餘

# budget.exceeded
source: 已超出
en: Exceeded
ja: 超過

# budget.exceeded.amount
source: 超出 %@
en: Exceeded by %@
ja: %@ 超過

# budget.used.percent
source: 已用 %lld%%
en: Used %lld%%
ja: 使用済み %lld%%

# budget.disabled
source: 已关闭
en: Disabled
ja: 無効
zh_hant: 已關閉

# budget.over
source: 超支
en: Over Budget
ja: 予算超過

# budget.normal
source: 正常
en: Normal

# budget.edit
source: 编辑预算
en: Edit Budget
ja: 予算を編集
zh_hant: 編輯預算

# budget.amount
source: 预算金额
en: Budget Amount
ja: 予算金額
zh_hant: 預算金額

# budget.enable
source: 启用预算
en: Enable Budget
ja: 予算を有効化
zh_hant: 啟用預算

# budget.enable.desc
source: 关闭后仍保留金额，计划页不计入提醒
en: Amount is retained when disabled. The Plans page won't include it in reminders.
ja: 無効にしても金額は保持されます。計画ページのリマインダーには含まれません。
zh_hant: 關閉後仍保留金額，計劃頁不計入提醒

# budget.local.desc
source: 预算仅保存在本机，按自然周和自然月统计支出。
en: Budget is saved locally only, tracking expenses by natural week and month.
ja: 予算はこの端末のみに保存され、自然週と自然月ごとに支出を集計します。
zh_hant: 預算僅儲存在本機，按自然週和自然月統計支出。

# budget.no.other
source: 暂无其他预算
en: No other budgets
ja: 他の予算がありません
zh_hant: 暫無其他預算

# budget.count
source: %lld 个预算
en: %lld budgets
ja: %lld個の予算
zh_hant: %lld 個預算

# subscription.title
source: 订阅
en: Subscriptions
ja: サブスクリプション
zh_hant: 訂閱

# subscription.add
source: 添加订阅
en: Add Subscription
ja: サブスクを追加
zh_hant: 新增訂閱

# subscription.edit
source: 编辑订阅
en: Edit Subscription
ja: サブスクを編集
zh_hant: 編輯訂閱

# subscription.detail
source: 订阅详情
en: Subscription Details
ja: サブスク詳細
zh_hant: 訂閱詳情

# subscription.name
source: 订阅名称
en: Subscription Name
ja: サブスク名
zh_hant: 訂閱名稱

# subscription.amount
source: 每期金额
en: Amount per Period
ja: 1回あたりの金額
zh_hant: 每期金額

# subscription.cycle
source: 扣费周期
en: Billing Cycle
ja: 請求サイクル
zh_hant: 扣費週期

# subscription.next.billing
source: 下次扣费
en: Next Billing
ja: 次回請求
zh_hant: 下次扣費

# subscription.info
source: 订阅信息
en: Subscription Info
ja: サブスク情報
zh_hant: 訂閱資訊

# subscription.billing.setting
source: 扣费设置
en: Billing Settings
ja: 請求設定
zh_hant: 扣費設定

# subscription.add.desc
source: 新增后会在这里显示下一次扣费时间与金额。
en: After adding, the next billing date and amount will be shown here.
ja: 追加すると、次回の請求日と金額がここに表示されます。
zh_hant: 新增後會在這裡顯示下一次扣費時間與金額。

# subscription.delete.title
source: 删除订阅
en: Delete Subscription
ja: サブスクを削除
zh_hant: 刪除訂閱

# subscription.delete.confirm
source: 删除「%@」？
en: Delete '%@'?
ja: 「%@」を削除しますか？
zh_hant: 刪除「%@」？

# subscription.delete.msg
source: 删除后不可恢复。
en: This cannot be undone.
ja: 削除後は元に戻せません。
zh_hant: 刪除後不可恢復。

# subscription.no
source: 暂无订阅
en: No subscriptions
ja: サブスクがありません
zh_hant: 暫無訂閱

# subscription.count
source: %lld 个订阅
en: %lld subscriptions
ja: %lld個のサブスク
zh_hant: %lld 個訂閱

# subscription.empty.title
source: 当前没有订阅项目
en: No subscription items
ja: サブスクリプション項目がありません
zh_hant: 目前沒有訂閱項目

# subscription.local.desc
source: 订阅记录保存在本地，到期后可手动记录为支出。
en: Subscription records are saved locally. You can manually record them as expenses when they're due.
ja: サブスクリプション記録はこの端末に保存されます。期日になったら手動で支出として記録できます。
zh_hant: 訂閱記錄儲存在本機，到期後可手動記錄為支出。

# installment.title
source: 分期进度
en: Installment Progress
ja: 分割払い進捗
zh_hant: 分期進度

# installment.add
source: 添加分期
en: Add Installment
ja: 分割払いを追加
zh_hant: 新增分期

# installment.edit
source: 编辑分期
en: Edit Installment
ja: 分割払いを編集
zh_hant: 編輯分期

# installment.detail
source: 分期详情
en: Installment Details
ja: 分割払い詳細
zh_hant: 分期詳情

# installment.name
source: 分期名称
en: Installment Name
ja: 分割払い名
zh_hant: 分期名稱

# installment.total
source: 总金额
en: Total Amount
ja: 合計金額
zh_hant: 總金額

# installment.periods
source: 期数
en: Number of Periods
ja: 回数
zh_hant: 期數

# installment.fee
source: 每期手续费
en: Fee per Period
ja: 1回あたりの手数料
zh_hant: 每期手續費

# installment.first.date
source: 首期日期
en: First Period Date
ja: 初回日

# installment.info
source: 分期信息
en: Installment Info
ja: 分割払い情報
zh_hant: 分期資訊

# installment.setting
source: 分期设置
en: Installment Settings
ja: 分割払い設定
zh_hant: 分期設定

# installment.progress
source: 还款进度
en: Repayment Progress
ja: 返済進捗
zh_hant: 還款進度

# installment.details
source: 分期明细
en: Installment Details
ja: 分割払い明細
zh_hant: 分期明細

# installment.period.n
source: 第 %lld 期
en: Period %lld
ja: 第%lld回

# installment.paid
source: 已还
en: Paid
ja: 支払済み
zh_hant: 已還

# installment.pending
source: 待还
en: Pending
ja: 未払い
zh_hant: 待還

# installment.delete.title
source: 删除分期
en: Delete Installment
ja: 分割払いを削除
zh_hant: 刪除分期

# installment.delete.confirm
source: 删除「%@」？
en: Delete '%@'?
ja: 「%@」を削除しますか？
zh_hant: 刪除「%@」？

# installment.delete.msg
source: 删除后不可恢复，所有期次记录将一并删除。
en: This cannot be undone. All period records will be deleted.
ja: この操作は元に戻せません。すべての分割回の記録が削除されます。
zh_hant: 刪除後無法復原，所有期次記錄將一併刪除。

# installment.no
source: 暂无分期
en: No installments
ja: 分割払いがありません
zh_hant: 暫無分期

# installment.count
source: %lld 个分期
en: %lld installments
ja: %lld件の分割払い
zh_hant: %lld 個分期

# installment.empty.title
source: 当前没有分期项目
en: No installment items
ja: 分割払い項目がありません
zh_hant: 目前沒有分期項目

# installment.empty.desc
source: 新增后会在这里显示剩余期数与每月应付金额。
en: After adding, the remaining periods and monthly payment amount will be shown here.
ja: 追加すると、残り回数と毎月の支払額がここに表示されます。
zh_hant: 新增後會在這裡顯示剩餘期數與每月應付金額。

# installment.per.period
source: 每期 %@
en: %@ per period
ja: 1回あたり %@

# installment.progress.n
source: %lld/%lld 期
en: %lld/%lld periods
ja: %lld/%lld回

# installment.remaining
source: 剩余 %lld 期
en: %lld periods remaining
ja: 残り%lld回
zh_hant: 剩餘 %lld 期

# installment.calc.desc
source: 每期应付 = 总金额 / 期数 + 手续费。系统会自动生成每期记录。
en: Payment per period = Total / Periods + Fee. The system automatically generates each period's record.
ja: 各回の支払額 = 合計金額 / 回数 + 手数料。各回の記録は自動で生成されます。
zh_hant: 每期應付 = 總金額 / 期數 + 手續費。系統會自動產生每期記錄。

# setting.title
source: 我的
en: Settings
ja: 設定

# setting.data
source: 数据
en: Data
ja: データ
zh_hant: 資料

# setting.security
source: 安全
en: Security
ja: セキュリティ

# setting.appearance
source: 外观
en: Appearance
ja: 外観
zh_hant: 外觀

# setting.ai.service
source: AI 服务
en: AI Service
ja: AIサービス
zh_hant: AI 服務

# setting.ledger
source: 账本管理
en: Ledger Management
ja: 台帳管理
zh_hant: 帳本管理

# setting.category
source: 分类管理
en: Category Management
ja: カテゴリ管理
zh_hant: 分類管理

# setting.account
source: 账户管理
en: Account Management
ja: アカウント管理
zh_hant: 帳戶管理

# setting.multi.currency
source: 多货币管理
en: Multi-Currency
ja: 多通貨管理
zh_hant: 多貨幣管理

# setting.icloud.sync
source: iCloud 云同步
en: iCloud Sync
ja: iCloud同期
zh_hant: iCloud 雲同步

# setting.import.export
source: 导入与导出
en: Import & Export
ja: インポートとエクスポート
zh_hant: 匯入與匯出

# setting.local.backup
source: 本地备份
en: Local Backup
ja: ローカルバックアップ
zh_hant: 本機備份

# setting.theme
source: 主题
en: Theme
ja: テーマ
zh_hant: 主題

# setting.stat.days
source: 记账天数
en: Days Recorded
ja: 記録日数
zh_hant: 記帳天數

# setting.stat.avg.expense
source: 日均支出
en: Avg Daily Expense
ja: 1日平均支出

# setting.stat.max.expense
source: 最大支出
en: Max Expense

# setting.privacy.lock
source: 隐私锁
en: Privacy Lock
ja: プライバシーロック
zh_hant: 隱私鎖

# setting.unlock.method
source: 解锁方式
en: Unlock Method
ja: ロック解除方法
zh_hant: 解鎖方式

# setting.change.password
source: 修改密码
en: Change Password
ja: パスワード変更
zh_hant: 修改密碼

# setting.auto.blur
source: 后台自动模糊
en: Auto Blur on Background
ja: バックグラウンド自動ぼかし
zh_hant: 後台自動模糊

# setting.lock.biometric
source: 生物识别
en: Biometric
ja: 生体認証
zh_hant: 生物辨識

# setting.lock.biometric.desc
source: 使用 Face ID 或 Touch ID
en: Use Face ID or Touch ID
ja: Face IDまたはTouch IDを使用

# setting.lock.biometric.unavailable
source: 设备不支持生物识别
en: Biometric not available on this device
ja: このデバイスでは生体認証が利用できません
zh_hant: 裝置不支援生物辨識

# setting.lock.passcode
source: 数字密码
en: Passcode
ja: 数字パスコード
zh_hant: 數字密碼

# setting.lock.passcode.desc
source: 使用6位数字密码解锁
en: Unlock with a 6-digit passcode
ja: 6桁のパスコードでロック解除
zh_hant: 使用6位數字密碼解鎖

# setting.lock.both
source: 生物识别 + 密码
en: Biometric + Passcode
ja: 生体認証 + パスコード
zh_hant: 生物辨識 + 密碼

# setting.lock.both.desc
source: 两种方式都可使用
en: Both methods available
ja: 両方の方法が利用可能
zh_hant: 兩種方式都可使用

# setting.ai.config
source: AI 服务配置
en: AI Service Configuration
ja: AIサービス設定
zh_hant: AI 服務設定

# setting.ai.select.provider
source: 选择服务商
en: Select Provider
ja: プロバイダーを選択
zh_hant: 選擇服務商

# setting.ai.provider
source: 服务商
en: Provider
ja: プロバイダー
zh_hant: 服務商

# setting.ai.test.connection
source: 测试连接
en: Test Connection
ja: 接続テスト
zh_hant: 測試連線

# setting.ai.test.success
source: 连接成功，API Key 有效
en: Connection successful, API Key is valid
ja: 接続成功、APIキーは有効です
zh_hant: 連線成功，API Key 有效

# setting.ai.test.fail
source: 连接失败：%@
en: Connection failed: %@
ja: 接続失敗：%@
zh_hant: 連線失敗：%@

# setting.ai.error.unauthorized
source: API Key 无效或未授权
en: Invalid or unauthorized API key
ja: APIキーが無効か、認可されていません
zh_hant: API Key 無效或未授權

# setting.ai.api.key.desc
source: API Key 用于 Siri 语音记账功能，调用 AI 解析账单文本。密钥存储在本地，不会上传到任何服务器。
en: The API Key is used for Siri voice recording, calling AI to parse billing text. The key is stored locally and never uploaded to any server.
ja: API Key は Siri 音声記録機能で、AI に記録テキストを解析させるために使います。キーは端末内に保存され、サーバーにはアップロードされません。
zh_hant: API Key 用於 Siri 語音記帳功能，呼叫 AI 解析帳單文字。密鑰儲存在本機，不會上傳到任何伺服器。

# setting.ai.providers.title
source: 各服务商说明：
en: Provider details:
ja: プロバイダー詳細：
zh_hant: 各服務商說明：

# setting.ai.providers.detail
source: • Claude: api.anthropic.com，推荐 Haiku 模型 • 千问: dashscope.aliyuncs.com，推荐 qwen-turbo • DeepSeek: api.deepseek.com，推荐 deepseek-chat
en: • Claude: api.anthropic.com, Haiku model recommended • Qwen: dashscope.aliyuncs.com, qwen-turbo recommended • DeepSeek: api.deepseek.com, deepseek-chat recommended
ja: • Claude: api.anthropic.com、Haiku モデルを推奨 • Qwen: dashscope.aliyuncs.com、qwen-turbo を推奨 • DeepSeek: api.deepseek.com、deepseek-chat を推奨
zh_hant: • Claude: api.anthropic.com，建議 Haiku 模型 • 通義千問: dashscope.aliyuncs.com，建議 qwen-turbo • DeepSeek: api.deepseek.com，建議 deepseek-chat

# setting.ai.enter.key
source: 输入 %@ API Key
en: Enter %@ API Key
ja: %@ APIキーを入力
zh_hant: 輸入 %@ API Key

# setting.ai.error.empty.key
source: 请先输入 API Key
en: Please enter an API Key first
ja: まずAPIキーを入力してください
zh_hant: 請先輸入 API Key

# setting.ai.error.invalid.url
source: URL 无效
en: Invalid URL
ja: 無効なURL
zh_hant: URL 無效

# setting.ai.error.unknown
source: 未知服务商
en: Unknown provider
ja: 不明なプロバイダー
zh_hant: 未知服務商

# sync.title
source: iCloud 云同步
en: iCloud Sync
ja: iCloud同期
zh_hant: iCloud 雲同步

# sync.enable
source: iCloud 云同步
en: iCloud Sync
ja: iCloud同期
zh_hant: iCloud 雲同步

# sync.enable.desc
source: 启用后自动同步数据到 iCloud
en: Automatically sync data to iCloud when enabled
ja: 有効にするとデータがiCloudに自動同期されます
zh_hant: 啟用後自動同步資料到iCloud

# sync.cellular
source: 允许蜂窝网络同步
en: Allow Cellular Sync
ja: モバイルデータでの同期を許可
zh_hant: 允許行動網路同步

# sync.cellular.desc
source: 关闭后仅在 Wi-Fi 下同步
en: Sync only over Wi-Fi when disabled
ja: 無効にするとWi-Fi環境下でのみ同期
zh_hant: 關閉後僅在 Wi-Fi 下同步

# sync.network.status
source: 网络状态
en: Network Status
ja: ネットワーク状態
zh_hant: 網路狀態

# sync.network.cellular
source: 蜂窝网络
en: Cellular
ja: モバイルデータ
zh_hant: 行動網路

# sync.network.none
source: 无网络
en: No Network
ja: ネットワークなし
zh_hant: 無網路

# sync.network.not.connected
source: 未连接
en: Not Connected
ja: 未接続
zh_hant: 未連線

# sync.icloud.connection
source: iCloud 连接
en: iCloud Connection
ja: iCloud接続
zh_hant: iCloud 連線

# sync.icloud.connected
source: 已连接，数据可同步
en: Connected, data can sync
ja: 接続済み、データを同期可能
zh_hant: 已連線，資料可同步

# sync.icloud.unavailable
source: 未登录或不可用
en: Not signed in or unavailable
ja: 未サインインまたは利用不可
zh_hant: 未登入或不可用

# sync.status
source: 同步状态
en: Sync Status
ja: 同期状態
zh_hant: 同步狀態

# sync.status.waiting
source: 等待同步
en: Waiting to sync
ja: 同期待ち

# sync.status.syncing
source: 正在同步...
en: Syncing...
ja: 同期中...

# sync.status.success
source: 同步成功
en: Sync successful
ja: 同期成功

# sync.status.failed
source: 同步失败
en: Sync failed
ja: 同期失敗
zh_hant: 同步失敗

# sync.status.network.unavailable
source: 网络不可用
en: Network unavailable
ja: ネットワーク利用不可
zh_hant: 網路不可用

# sync.status.icloud.unavailable
source: iCloud 不可用
en: iCloud unavailable
ja: iCloud利用不可

# sync.status.cellular.disabled
source: 蜂窝网络同步已关闭
en: Cellular sync is disabled
ja: モバイルデータ同期が無効です
zh_hant: 行動網路同步已關閉

# sync.manual
source: 手动同步
en: Manual Sync
ja: 手動同期
zh_hant: 手動同步

# sync.last.time
source: 上次同步：%@
en: Last sync: %@
ja: 前回の同期：%@

# sync.button
source: 同步
en: Sync
ja: 同期

# sync.notes
source: 同步说明
en: Sync Notes
ja: 同期について
zh_hant: 同步說明

# sync.notes.detail
source: • 启用后数据通过 CloudKit 自动同步到 iCloud • 同一 Apple ID 的设备间自动同步 • 默认仅在 Wi-Fi 下同步，可开启蜂窝同步 • 同步过程不影响正常使用
en: • Data syncs to iCloud via CloudKit when enabled • Automatic sync between devices with the same Apple ID • Syncs over Wi-Fi only by default, cellular can be enabled • Sync doesn't affect normal usage
ja: • 有効にすると、データは CloudKit 経由で iCloud に自動同期されます • 同じ Apple ID のデバイス間で自動同期されます • 既定では Wi-Fi のみで同期します。モバイル通信での同期も有効にできます • 同期中も通常どおり使用できます
zh_hant: • 啟用後資料會透過 CloudKit 自動同步到 iCloud • 同一 Apple ID 的裝置之間會自動同步 • 預設僅在 Wi-Fi 下同步，可開啟行動網路同步 • 同步過程不影響正常使用

# backup.title
source: 本地备份
en: Local Backup
ja: ローカルバックアップ
zh_hant: 本機備份

# backup.create
source: 创建备份
en: Create Backup
ja: バックアップ作成
zh_hant: 建立備份

# backup.encrypted
source: 加密备份
en: Encrypted Backup
ja: 暗号化バックアップ
zh_hant: 加密備份

# backup.encrypted.desc
source: 使用 AES-GCM 加密，保护数据隐私
en: Uses AES-GCM encryption to protect data privacy
ja: AES-GCM暗号化でデータのプライバシーを保護
zh_hant: 使用 AES-GCM 加密，保護資料隱私

# backup.password
source: 备份密码
en: Backup Password
ja: バックアップパスワード
zh_hant: 備份密碼

# backup.set.password
source: 设置密码
en: Set Password
ja: パスワード設定
zh_hant: 設定密碼

# backup.restore
source: 恢复备份
en: Restore Backup
ja: バックアップ復元
zh_hant: 還原備份

# backup.restore.from
source: 从备份恢复
en: Restore from Backup
ja: バックアップから復元
zh_hant: 從備份還原

# backup.restore.file.hint
source: 选择 .numibackup 文件并输入密码
en: Select a .numibackup file and enter the password
ja: .numibackupファイルを選択してパスワードを入力
zh_hant: 選擇 .numibackup 檔案並輸入密碼

# backup.restore.warning
source: 恢复会覆盖当前所有数据，请确保已备份当前数据。
en: Restoring will overwrite all current data. Please ensure you've backed up current data first.
ja: 復元すると現在のすべてのデータが上書きされます。先に現在のデータをバックアップしてください。
zh_hant: 復原會覆蓋目前所有資料，請先確認已備份目前資料。

# backup.success
source: 备份创建成功
en: Backup created successfully
ja: バックアップ作成成功
zh_hant: 備份建立成功
